src/notes/life-and-universe.org
#+TITLE: Life and Universe
#+DATE: 2005-06-05
#+DESCRIPTION: A young mind wondering what sits inside the smallest particle we have ever seen, and whether we ourselves might be sitting inside some larger universe waiting to be discovered by somebody else.
#+FILETAGS: :personal:
#+OPTIONS: toc:nil

Have we seen the smallest particle? I do not think anybody knows the answer. Who knows if there is another universe inside the smallest particle which we have not yet seen. And who knows if we are lying inside a particle which is yet to be seen by some other forms of life in this universe. I have been searching for this secret for quite some time now. I wonder if I will ever get all the answers. There will always be unanswered questions.
